zhiyongchenGREAT/SHU_FlightControl_TM4C/Basic_Flight_Code/board/YRK_NRF24L0.c
/*!
*     COPYRIGHT NOTICE
*     Copyright (c) 2013,野火科技
*     All rights reserved.
*     技术讨论：野火初学论坛 http://www.chuxue123.com
*
*     除注明出处外，以下所有内容版权均属野火科技所有，未经允许，不得用于商业用途，
*     修改内容时必须保留野火科技的版权声明。
*
* @file       FIRE_NRF24L0.c
* @brief      无线调试  函数
* @author     野火科技
* @version    v5.0
* @date       2014-01-04
*/

#include "common.h"
//#include "MKL_port.h"
//#include "MKL_gpio.h"
//#include "MKL_spi.h"

#include "YRK_NRF24L0.h"


#include "inc/hw_types.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_ints.h"
#include "inc/hw_nvic.h"
#include "inc/hw_memmap.h"
#include "inc/hw_gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/rom.h"
#include "driverlib/pin_map.h"
#include "driverlib/ssi.h"
#include "driverlib/rom_map.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"



//以下是硬件配置
#define NRF_SSI_PERIPH                  SYSCTL_PERIPH_SSI0
#define NRF_SSI_GPIO_PERIPH             SYSCTL_PERIPH_GPIOA
#define NRF_SSI_GPIO_BASE               GPIO_PORTA_BASE
#define NRF_SSI_BASE                    SSI0_BASE
#define NRF_CSN_PERIPH                  SYSCTL_PERIPH_GPIOA
#define NRF_CSN_BASE                    GPIO_PORTA_BASE
#define NRF_CSN_PIN                     GPIO_PIN_3
#define NRF_CE_PERIPH                   SYSCTL_PERIPH_GPIOC
#define NRF_CE_BASE                     GPIO_PORTC_BASE
#define NRF_CE_PIN                      GPIO_PIN_4
#define NRF_IRQ_PERIPH                  SYSCTL_PERIPH_GPIOC
#define NRF_IRQ_BASE                    GPIO_PORTC_BASE
#define NRF_IRQ_PIN                     GPIO_PIN_5
#define NRF_IRQ_INT_VECTOR              INT_GPIOC
#define NRF_IRQ_INT_PIN                 GPIO_INT_PIN_5



//#define NRF_SPI         SPI1
//#define NRF_CS          SPI_PCS0

//#define NRF_CE_PTXn     PTE5
//#define NRF_IRQ_PTXn    PTC18


//NRF24L01+状态
typedef enum
{
  NOT_INIT = 0,
  TX_MODE,
  RX_MODE,
} nrf_mode_e;

typedef enum
{
  QUEUE_EMPTY = 0,        //队列空模式，只可入队列
  QUEUE_NORMAL,           //正常模式，可正常出入队列，即队列不空不满
  QUEUE_FULL,             //队列满模式，满了则不再添加，丢弃掉数据
} nrf_rx_queueflag_e; //中断接收时，队列状态标记位


//gpio控制CE和IRQ
#define NRF_CE_HIGH()       ROM_GPIOPinWrite(NRF_CE_BASE, NRF_CE_PIN, NRF_CE_PIN)
#define NRF_CE_LOW()        ROM_GPIOPinWrite(NRF_CE_BASE, NRF_CE_PIN, 0)          //CE置低

#define NRF_CSN_HIGH()      ROM_GPIOPinWrite(NRF_CSN_BASE, NRF_CSN_PIN, NRF_CSN_PIN)
#define NRF_CSN_LOW()       ROM_GPIOPinWrite(NRF_CSN_BASE, NRF_CSN_PIN, 0)          //CE置低

#define NRF_Read_IRQ()      GPIOPinRead(NRF_IRQ_BASE,NRF_IRQ_PIN)

// 用户配置 发送和 接收地址，频道

uint8 TX_ADDRESS[5] = {0x11, 0x23, 0x58, 0x13, 0x58};   // 定义一个静态发送地址
uint8 RX_ADDRESS[5] = {0x11, 0x23, 0x58, 0x13, 0x58};

#define CHANAL           108                            //频道选择


// 内部配置参量
#define TX_ADR_WIDTH    ADR_WIDTH                       //发射地址宽度
#define TX_PLOAD_WIDTH  DATA_PACKET                     //发射数据通道有效数据宽度0~32Byte

#define RX_ADR_WIDTH    ADR_WIDTH                       //接收地址宽度
#define RX_PLOAD_WIDTH  DATA_PACKET                     //接收数据通道有效数据宽度0~32Byte

/******************************** NRF24L01+ 寄存器命令 宏定义***************************************/

// SPI(nRF24L01) commands , NRF的SPI命令宏定义，详见NRF功能使用文档
#define NRF_READ_REG    0x00    // Define read command to register
#define NRF_WRITE_REG   0x20    // Define write command to register
#define RD_RX_PLOAD     0x61    // Define RX payload register address
#define WR_TX_PLOAD     0xA0    // Define TX payload register address
#define FLUSH_TX        0xE1    // Define flush TX register command
#define FLUSH_RX        0xE2    // Define flush RX register command
#define REUSE_TX_PL     0xE3    // Define reuse TX payload register command
#define NOP             0xFF    // Define No Operation, might be used to read status register

// SPI(nRF24L01) registers(addresses) ，NRF24L01 相关寄存器地址的宏定义
#define CONFIG      0x00        // 'Config' register address
#define EN_AA       0x01        // 'Enable Auto Acknowledgment' register address
#define EN_RXADDR   0x02        // 'Enabled RX addresses' register address
#define SETUP_AW    0x03        // 'Setup address width' register address
#define SETUP_RETR  0x04        // 'Setup Auto. Retrans' register address
#define RF_CH       0x05        // 'RF channel' register address
#define RF_SETUP    0x06        // 'RF setup' register address
#define STATUS      0x07        // 'Status' register address
#define OBSERVE_TX  0x08        // 'Observe TX' register address
#define CD          0x09        // 'Carrier Detect' register address
#define RX_ADDR_P0  0x0A        // 'RX address pipe0' register address
#define RX_ADDR_P1  0x0B        // 'RX address pipe1' register address
#define RX_ADDR_P2  0x0C        // 'RX address pipe2' register address
#define RX_ADDR_P3  0x0D        // 'RX address pipe3' register address
#define RX_ADDR_P4  0x0E        // 'RX address pipe4' register address
#define RX_ADDR_P5  0x0F        // 'RX address pipe5' register address
#define TX_ADDR     0x10        // 'TX address' register address
#define RX_PW_P0    0x11        // 'RX payload width, pipe0' register address
#define RX_PW_P1    0x12        // 'RX payload width, pipe1' register address
#define RX_PW_P2    0x13        // 'RX payload width, pipe2' register address
#define RX_PW_P3    0x14        // 'RX payload width, pipe3' register address
#define RX_PW_P4    0x15        // 'RX payload width, pipe4' register address
#define RX_PW_P5    0x16        // 'RX payload width, pipe5' register address
#define FIFO_STATUS 0x17        // 'FIFO Status Register' register address


//几个重要的状态标记
#define TX_FULL     0x01        //TX FIFO 寄存器满标志。 1 为 满，0为 不满
#define MAX_RT      0x10        //达到最大重发次数中断标志位
#define TX_DS       0x20        //发送完成中断标志位
#define RX_DR       0x40        //接收到数据中断标志位



//内部寄存器操作函数声明
static  uint8   nrf_writereg(uint8 reg, uint8 dat);
static  uint8   nrf_readreg (uint8 reg, uint8 *dat);

static  uint8   nrf_writebuf(uint8 reg , uint8 *pBuf, uint32 len);
static  uint8   nrf_readbuf (uint8 reg, uint8 *pBuf, uint32  len);


static  void    nrf_rx_mode(void);           //进入接收模式
static  void    nrf_tx_mode(void);           //进入发送模式

/*!
*  @brief      NRF24L01+ 模式标记
*/
volatile uint8  nrf_mode = NOT_INIT;


volatile uint8  nrf_rx_front = 0, nrf_rx_rear = 0;              //接收FIFO的指针
volatile uint8  nrf_rx_flag = QUEUE_EMPTY;

uint8 NRF_ISR_RX_FIFO[RX_FIFO_PACKET_NUM][DATA_PACKET];         //中断接收的FIFO


volatile uint8    *nrf_irq_tx_addr      = NULL;
volatile uint32    nrf_irq_tx_pnum      = 0;                    //pnum = (len+MAX_ONCE_TX_NUM -1)  / MAX_ONCE_TX_NUM

volatile uint8      nrf_irq_tx_flag  = 0;                     //0 表示成功 ，1 表示 发送失败

/*!
*  @brief      NRF24L01+初始化，默认进入接收模式
*  @return     初始化成功标记，0为初始化失败，1为初始化成功
*  @since      v5.0
*  Sample usage:
while(!nrf_init())                                     //初始化NRF24L01+ ,等待初始化成功为止
{
printf("\n  NRF与MCU连接失败，请重新检查接线。\n");
                     }

printf("\n      NRF与MCU连接成功！\n");
*/
void config_ssi_gpio(void)
{
  /* Config Tx on SSI1, PF0-PF3 + PB0/PB3. */
  ROM_SysCtlPeripheralEnable(NRF_SSI_PERIPH);
  ROM_SysCtlPeripheralEnable(NRF_SSI_GPIO_PERIPH);
  
  ROM_GPIOPinConfigure(GPIO_PA2_SSI0CLK);
  ROM_GPIOPinConfigure(GPIO_PA4_SSI0RX);
  ROM_GPIOPinConfigure(GPIO_PA5_SSI0TX);
  ROM_GPIOPinTypeSSI(NRF_SSI_GPIO_BASE, GPIO_PIN_2|GPIO_PIN_4|GPIO_PIN_5);
  
  /* CSN pin, high initially */
  ROM_SysCtlPeripheralEnable(NRF_CSN_PERIPH);
  ROM_GPIOPinTypeGPIOOutput(NRF_CSN_BASE, NRF_CSN_PIN);
  ROM_GPIOPinWrite(NRF_CSN_BASE, NRF_CSN_PIN, NRF_CSN_PIN);
  /* CE pin, low initially */
  ROM_SysCtlPeripheralEnable(NRF_CE_PERIPH);
  ROM_GPIOPinTypeGPIOOutput(NRF_CE_BASE, NRF_CE_PIN);
  ROM_GPIOPinWrite(NRF_CE_BASE, NRF_CE_PIN, NRF_CE_PIN);
  /* IRQ pin as input. */
  ROM_SysCtlPeripheralEnable(NRF_IRQ_PERIPH);
  ROM_GPIOPinTypeGPIOInput(NRF_IRQ_BASE, NRF_IRQ_PIN);
  
}
void config_spi(uint32_t base)
{
  /*
  Configure the SPI for correct mode to read from nRF24L01+.
  
  We need CLK inactive low, so SPO=0.
  We need to setup and sample on the leading, rising CLK edge, so SPH=0.
  
  The datasheet says up to 10MHz SPI is possible, depending on load
  capacitance. Let's go with a slightly cautious 8MHz, which should be
  aplenty.
  */
  
  //ROM_SSIDisable(base);
  ROM_SSIConfigSetExpClk(base, ROM_SysCtlClockGet(), SSI_FRF_MOTO_MODE_0,
                         SSI_MODE_MASTER, 9000000, 8);
  ROM_SSIEnable(base);
}
void nrfspiinit()
{
  config_ssi_gpio();
  config_spi(NRF_SSI_BASE);
}
uint8 nrftest()
{
  uint8 data;
  nrf_readreg(FIFO_STATUS,&data);
  return data;
}
uint8 nrf_IRQ_reg(void (*pfnHandler)(void))
{
  IntRegister(NRF_IRQ_INT_VECTOR,pfnHandler);
  return 0;
}

uint8 nrf_init(void (*pfnHandler)(void))
{
  //配置NRF管脚复用
  //spi_init(NRF_SPI, NRF_CS, MASTER,12500*1000);                     //初始化SPI,主机模式
  // gpio_init(NRF_CE_PTXn, GPO, LOW);                               //初始化CE，默认进入待机模式
  
  // gpio_init(NRF_IRQ_PTXn, GPI, LOW);                              //初始化IRQ管脚为输入
  
  nrfspiinit();
  
  ROM_GPIOIntTypeSet(NRF_IRQ_BASE,NRF_IRQ_PIN,GPIO_FALLING_EDGE);
  
  GPIOIntEnable(NRF_IRQ_BASE, NRF_IRQ_INT_PIN);
  IntRegister(NRF_IRQ_INT_VECTOR,pfnHandler);
  IntEnable(NRF_IRQ_INT_VECTOR); 
  //port_init_NoALT(NRF_IRQ_PTXn, IRQ_FALLING | PULLUP);            //初始化IRQ管脚为下降沿 触发中断
  
  //配置NRF寄存器
  NRF_CE_LOW();
  
  nrf_writereg(NRF_WRITE_REG + SETUP_AW, ADR_WIDTH - 2);          //设置地址长度为 TX_ADR_WIDTH
  
  nrf_writereg(NRF_WRITE_REG + RF_CH, CHANAL);                    //设置RF通道为CHANAL
  nrf_writereg(NRF_WRITE_REG + RF_SETUP, 0x0f);                   //设置TX发射参数,0db增益,2Mbps,低噪声增益开启
  
  nrf_writereg(NRF_WRITE_REG + EN_AA, 0x01);                      //使能通道0的自动应答
  
  nrf_writereg(NRF_WRITE_REG + EN_RXADDR, 0x01);                  //使能通道0的接收地址
  
  //RX模式配置
  nrf_writebuf(NRF_WRITE_REG + RX_ADDR_P0, RX_ADDRESS, RX_ADR_WIDTH); //写RX节点地址
  
  nrf_writereg(NRF_WRITE_REG + RX_PW_P0, RX_PLOAD_WIDTH);         //选择通道0的有效数据宽度
  
  nrf_writereg(FLUSH_RX, NOP);                                    //清除RX FIFO寄存器
  
  //TX模式配置
  nrf_writebuf(NRF_WRITE_REG + TX_ADDR, TX_ADDRESS, TX_ADR_WIDTH); //写TX节点地址
  
  nrf_writereg(NRF_WRITE_REG + SETUP_RETR, 0x08);                 //设置自动重发间隔时间:250us + 86us;最大自动重发次数:15次
  
  nrf_writereg(FLUSH_TX, NOP);                                    //清除TX FIFO寄存器
  
  nrf_rx_mode();                                                  //默认进入接收模式
  
  NRF_CE_HIGH();
  
  return nrf_link_check();
  
}

/*!
*  @brief      NRF24L01+写寄存器
*  @param      reg         寄存器
*  @param      dat         需要写入的数据
*  @return     NRF24L01+ 状态
*  @since      v5.0
*  Sample usage:    nrf_writereg(NRF_WRITE_REG + RF_CH, CHANAL);   //设置RF通道为CHANAL
*/
void ssi_cmd(uint8_t *recvbuf, const uint8_t *sendbuf, uint32_t len,
             uint32_t ssi_base)
{
  uint32_t i;
  uint32_t data;
  
  /* Take CSN low to initiate transfer. */
  NRF_CSN_LOW(); 
  
  for (i = 0; i < len; ++i)
  {
    ROM_SSIDataPut(ssi_base, sendbuf[i]);
    while (ROM_SSIBusy(ssi_base))
      ;
    ROM_SSIDataGet(ssi_base, &data);
    recvbuf[i] = data;
  }
  NRF_CSN_HIGH(); 
}
void bzero(uint8_t *buf, uint32_t len)
{
  while (len > 0)
  {
    *buf++ = 0;
    --len;
  }
}

uint8 nrf_writereg(uint8 reg, uint8 dat)
{
  uint8 buff[2];
  
  buff[0] = reg;          //先发送寄存器
  buff[1] = dat;          //再发送数据
  
  ssi_cmd(buff, buff, 2,NRF_SSI_BASE); //发送buff里数据，并采集到 buff里
  
  /*返回状态寄存器的值*/
  return buff[0];
}

/*!
*  @brief      NRF24L01+读寄存器
*  @param      reg         寄存器
*  @param      dat         需要读取的数据的存放地址
*  @return     NRF24L01+ 状态
*  @since      v5.0
*  Sample usage:
uint8 data;
nrf_readreg(STATUS,&data);
*/
uint8 nrf_readreg(uint8 reg, uint8 *dat)
{
  
  uint8 buff[2];
  
  buff[0] = reg;          //先发送寄存器
  
  ssi_cmd(buff, buff, 2,NRF_SSI_BASE); //发送buff数据，并保存到buff里
  
  *dat = buff[1];                         //提取第二个数据
  
  /*返回状态寄存器的值*/
  return buff[0];
}

/*!
*  @brief      NRF24L01+写寄存器一串数据
*  @param      reg         寄存器
*  @param      pBuf        需要写入的数据缓冲区
*  @param      len         需要写入数据长度
*  @return     NRF24L01+ 状态
*  @since      v5.0
*  Sample usage:    nrf_writebuf(NRF_WRITE_REG+TX_ADDR,TX_ADDRESS,TX_ADR_WIDTH);    //写TX节点地址
*/
uint8 nrf_writebuf(uint8 reg , uint8 *pBuf, uint32 len)
{
  uint8_t sendbuf[33], recvbuf[33];
  
  if (len > 32)
    len = 32;
  sendbuf[0] = reg;
  memcpy(&sendbuf[1], pBuf, len);
  ssi_cmd(recvbuf, sendbuf, len+1, NRF_SSI_BASE);
  // ssi_cmd(NRF_SPI, NRF_CS, &reg , NULL, pBuf, NULL, 1 , len); //发送 reg ，pBuf 内容，不接收
  return reg;    //返回NRF24L01的状态
}


/*!
*  @brief      NRF24L01+读寄存器一串数据
*  @param      reg         寄存器
*  @param      dat         需要读取的数据的存放地址
*  @param      len         需要读取的数据长度
*  @return     NRF24L01+ 状态
*  @since      v5.0
*  Sample usage:
uint8 data;
nrf_readreg(STATUS,&data);
*/
uint8 nrf_readbuf(uint8 reg, uint8 *pBuf, uint32 len)
{
  //spi_mosi_cmd(NRF_SPI, NRF_CS, &reg , NULL, NULL, pBuf, 1 , len); //发送reg，接收到buff
  uint8_t sendbuf[33], recvbuf[33];
  if (len > 32)
    len = 32;
  sendbuf[0] = reg;
  bzero(&sendbuf[1], len);
  ssi_cmd(recvbuf, sendbuf, len+1, NRF_SSI_BASE);
  memcpy(pBuf, &recvbuf[1], len);
  
  return reg;    //返回NRF24L01的状态
}

/*!
*  @brief      检测NRF24L01+与MCU是否正常连接
*  @return     NRF24L01+ 的通信状态，0表示通信不正常，1表示正常
*  @since      v5.0
*/
uint8 nrf_link_check(void)
{
#define NRF_CHECH_DATA  0xC2        //此值为校验数据时使用，可修改为其他值
  
  uint8 reg;
  
  uint8 buff[5] = {NRF_CHECH_DATA, NRF_CHECH_DATA, NRF_CHECH_DATA, NRF_CHECH_DATA, NRF_CHECH_DATA};
  uint8 i;
  
  
  reg = NRF_WRITE_REG + TX_ADDR;
  //spi_mosi_cmd(NRF_SPI, NRF_CS, &reg, NULL , buff, NULL, 1 , 5); //写入校验数据
  nrf_writebuf(reg , buff, 5);
  //ssi_cmd(recvbuf, sendbuf, len+1, NRF_SSI_BASE);
  
  reg = TX_ADDR;
  //spi_mosi_cmd(NRF_SPI, NRF_CS, &reg, NULL , NULL, buff, 1 , 5); //读取校验数据
  nrf_readbuf(reg , buff, 5);
  
  
  /*比较*/
  for(i = 0; i < 5; i++)
  {
    if(buff[i] != NRF_CHECH_DATA)
    {
      return 0 ;        //MCU与NRF不正常连接
    }
  }
  return 1 ;             //MCU与NRF成功连接
}

/*!
*  @brief      NRF24L01+进入接收模式
*  @since      v5.0
*/
void nrf_rx_mode(void)
{
  NRF_CE_LOW();
  
  nrf_writereg(NRF_WRITE_REG + EN_AA, 0x01);          //使能通道0的自动应答
  
  nrf_writereg(NRF_WRITE_REG + EN_RXADDR, 0x01);      //使能通道0的接收地址
  
  nrf_writebuf(NRF_WRITE_REG + RX_ADDR_P0, RX_ADDRESS, RX_ADR_WIDTH); //写RX节点地址
  
  
  nrf_writereg(NRF_WRITE_REG + CONFIG, 0x0B | (IS_CRC16 << 2));       //配置基本工作模式的参数;PWR_UP,EN_CRC,16BIT_CRC,接收模式
  
  /* 清除中断标志*/
  nrf_writereg(NRF_WRITE_REG + STATUS, 0xff);
  
  nrf_writereg(FLUSH_RX, NOP);                    //清除RX FIFO寄存器
  
  /*CE拉高，进入接收模式*/
  NRF_CE_HIGH();
  
  nrf_mode = RX_MODE;
}

/*!
*  @brief      NRF24L01+进入发送模式
*  @since      v5.0
*/
void nrf_tx_mode(void)
{
  volatile uint32 i;
  
  NRF_CE_LOW();
  //DELAY_MS(1);
  
  nrf_writebuf(NRF_WRITE_REG + TX_ADDR, TX_ADDRESS, TX_ADR_WIDTH); //写TX节点地址
  
  nrf_writebuf(NRF_WRITE_REG + RX_ADDR_P0, RX_ADDRESS, RX_ADR_WIDTH); //设置RX节点地址 ,主要为了使能ACK
  
  nrf_writereg(NRF_WRITE_REG + CONFIG, 0x0A | (IS_CRC16 << 2)); //配置基本工作模式的参数;PWR_UP,EN_CRC,16BIT_CRC,发射模式,开启所有中断
  
  
  /*CE拉高，进入发送模式*/
  NRF_CE_HIGH();
  
  nrf_mode = TX_MODE;
  
  i = 0x0fff;
  while(i--);         //CE要拉高一段时间才进入发送模式
  
  //DELAY_MS(1);
  
  
}




uint32  nrf_rx(uint8 *rxbuf, uint32 len)
{
  uint32 tmplen = 0;
  uint8 tmp;
  
  while( (nrf_rx_flag != QUEUE_EMPTY) && (len != 0) )
  {
    if(len < DATA_PACKET)
    {
      memcpy(rxbuf, (uint8 *)&(NRF_ISR_RX_FIFO[nrf_rx_front]), len);
      
      NRF_CE_LOW();           //进入待机状态
      
      nrf_rx_front++;                //由于非空，所以可以直接出队列
      
      if(nrf_rx_front >= RX_FIFO_PACKET_NUM)
      {
        nrf_rx_front = 0;          //重头开始
      }
      tmp =  nrf_rx_rear;
      if(nrf_rx_front == tmp)       //追到屁股了，接收队列空
      {
        nrf_rx_flag = QUEUE_EMPTY;
      }
      NRF_CE_HIGH();          //进入接收模式
      
      tmplen += len;
      return tmplen;
    }
    
    memcpy(rxbuf, (uint8 *)&(NRF_ISR_RX_FIFO[nrf_rx_front]), DATA_PACKET);      //#define DATA_PACKET  32; len >= DATA_PACKET only save DATA_PACKET(32) data to rxbuf
    rxbuf   += DATA_PACKET;
    len     -= DATA_PACKET;
    tmplen  += DATA_PACKET;
    
    NRF_CE_LOW();           //进入待机状态
    
    nrf_rx_front++;                //由于非空，所以可以直接出队列
    
    if(nrf_rx_front >= RX_FIFO_PACKET_NUM)
    {
      nrf_rx_front = 0;          //重头开始
    }
    tmp  = nrf_rx_rear;
    if(nrf_rx_front == tmp)       //追到屁股了，接收队列空
    {
      nrf_rx_flag = QUEUE_EMPTY;
    }
    else
    {
      nrf_rx_flag = QUEUE_NORMAL;
    }
    NRF_CE_HIGH();          //进入接收模式
  }
  
  return tmplen;
}

uint8    nrf_tx(uint8 *txbuf, uint32 len)
{
  nrf_irq_tx_flag = 0;        //复位标志位
  
  if((txbuf == 0 ) || (len == 0))
  {
    return 0;
  }
  
  if(nrf_irq_tx_addr == 0 )
  {
    //
    nrf_irq_tx_pnum = (len - 1) / DATA_PACKET;        // 进 1 求得 包 的数目
    nrf_irq_tx_addr = txbuf;
    
    if( nrf_mode != TX_MODE)
    {
      nrf_tx_mode();
    }
    
    //需要 先发送一次数据包后才能 中断发送
    
    /*ce为低，进入待机模式1*/
    NRF_CE_LOW();
    
    /*写数据到TX BUF 最大 32个字节*/
    nrf_writebuf(WR_TX_PLOAD, txbuf, DATA_PACKET);
    
    /*CE为高，txbuf非空，发送数据包 */
    NRF_CE_HIGH();
    
    return 1;
  }
  else
  {
    return 0;
  }
}

nrf_tx_state_e nrf_tx_state ()
{
  /*
  if(nrf_mode != TX_MODE)
  {
  return NRF_NOT_TX;
}
  */
  
  if((nrf_irq_tx_addr == 0) && (nrf_irq_tx_pnum == 0))
  {
    //发送完成
    if(nrf_irq_tx_flag)
    {
      return NRF_TX_ERROR;
    }
    else
    {
      return NRF_TX_OK;
    }
  }
  else
  {
    return NRF_TXING;
  }
}

void nrf_handler(void)
{
  uint8 state;
  uint8 tmp;
  /*读取status寄存器的值  */
  nrf_readreg(STATUS, &state);
  
  /* 清除中断标志*/
  nrf_writereg(NRF_WRITE_REG + STATUS, state);
  
  if(state & RX_DR) //接收到数据
  {
    NRF_CE_LOW();
    
    if(nrf_rx_flag != QUEUE_FULL)
    {
      //还没满，则继续接收
      //printf("+");
      nrf_readbuf(RD_RX_PLOAD, (uint8 *)&(NRF_ISR_RX_FIFO[nrf_rx_rear]), RX_PLOAD_WIDTH); //读取数据
      
      nrf_rx_rear++;
      
      if(nrf_rx_rear >= RX_FIFO_PACKET_NUM)                                     //#define RX_FIFO_PACKET_NUM      80 
      {
        nrf_rx_rear = 0;                                                        //重头开始 nrf_rx_rear = 0； nrf_rx_front = 0
      }
      tmp = nrf_rx_front;
      if(nrf_rx_rear == tmp)                                                    //追到屁股了，满了nrf_rx_rear == nrf_rx_front == 0
      {
        nrf_rx_flag = QUEUE_FULL;
      }
      else
      {
        nrf_rx_flag = QUEUE_NORMAL;
      }
    }
    else
    {
      nrf_writereg(FLUSH_RX, NOP);                    //清除RX FIFO寄存器
    }
    NRF_CE_HIGH();                                      //进入接收模式
  }
  
  if(state & TX_DS) //发送完数据                                                //::note::how will nrf transmmit use this nrf_handler()?
  {
    if(nrf_irq_tx_pnum == 0)
    {
      nrf_irq_tx_addr = 0;
      
      // 注意: nrf_irq_tx_pnum == 0 表示 数据 已经全部发送到FIFO 。 nrf_irq_tx_addr == 0 才是 全部发送完了
      
      //发送完成后 默认 进入 接收模式
#if 1
      if( nrf_mode != RX_MODE)
      {
        nrf_rx_mode();
      }
#endif
      
      //发送长度 为 0个包，即发送完成
      //nrf_writereg(FLUSH_TX, NOP);                        //清除TX FIFO寄存器
    }
    else
    {
      if( nrf_mode != TX_MODE)
      {
        nrf_tx_mode();
      }
      
      //还没发送完成，就继续发送
      nrf_irq_tx_addr += DATA_PACKET;    //指向下一个地址
      nrf_irq_tx_pnum --;                 //包数目减少
      
      /*ce为低，进入待机模式1*/
      NRF_CE_LOW();
      
      /*写数据到TX BUF 最大 32个字节*/
      nrf_writebuf(WR_TX_PLOAD, (uint8 *)nrf_irq_tx_addr, DATA_PACKET);
      
      /*CE为高，txbuf非空，发送数据包 */
      NRF_CE_HIGH();
    }
  }
  
  if(state & MAX_RT)      //发送超时
  {
    nrf_irq_tx_flag = 1;                            //标记发送失败
    nrf_writereg(FLUSH_TX, NOP);                    //清除TX FIFO寄存器
    
    
    //有可能是 对方也处于 发送状态
    
    //放弃本次发送
    nrf_irq_tx_addr = 0;
    nrf_irq_tx_pnum = 0;
    
    nrf_rx_mode();                                  //进入 接收状态
    
    
    //printf("\nMAX_RT");
  }
  
  if(state & TX_FULL) //TX FIFO 满
  {
    //printf("\nTX_FULL");
    
  }
}


//检测 接收FIFO 的数据  (0 没接收够 、1 为接收正确)
uint8  nrf_rx_fifo_check(uint32 offset,uint16 * val)
{
  uint8 rx_num = (offset + 1 + DATA_PACKET - 1 ) / DATA_PACKET;   //加1 是因为返回2个字节，最后一个自己所在的包数。
  //+ DATA_PACKET - 1 是四舍五入
  uint8 tmp;
  if(nrf_rx_flag == QUEUE_EMPTY)
  {
    return 0;
  }
  
  if(rx_num > RX_FIFO_PACKET_NUM)                                 //偏移太大，超过 FIFO 限制
  {
    return 0;
  }
  
  rx_num = nrf_rx_front + rx_num - 1;                             //目标查询的 包的位置
  tmp =  nrf_rx_rear;
  if(nrf_rx_front <  tmp)                                 //接收数据在 一圈之内
  {
    if(rx_num >= nrf_rx_rear )                                  //没接收足够的数据
    {
      return 0;
    }
    
    //获取数据
    
  }
  else                                                            //越过一圈
  {
    if(rx_num >= RX_FIFO_PACKET_NUM)                            //超过一圈
    {
      rx_num -= RX_FIFO_PACKET_NUM;
      
      if( rx_num >= nrf_rx_rear )                             //还没接收够
      {
        return 0;
      }
    }
    //获取数据
  }
  
  //获取数据
  *val = *(uint16 *)((char *)&NRF_ISR_RX_FIFO + ( rx_num*DATA_PACKET + (offset % DATA_PACKET - 2) )) ;
  return 1;
  
}


